I just tried reproducing this with your exact versions that you reported in the issue, it seems to just work here.. Which OS are you running on?
```
$ ./terraform init -upgrade

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "azurerm" (hashicorp/azurerm) 2.49.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

$ ./terraform apply
Acquiring state lock. This may take a few moments...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.example will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "eastus2"
      + name                                  = "tf-test-appinsights2"
      + resource_group_name                   = "vlad-example2"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "vlad-example2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_resource_group.example: Creating...
azurerm_resource_group.example: Creation complete after 1s [id=/subscriptions/4e094144-afbc-420a-8d74-a4a0da618a3b/resourceGroups/vlad-example2]
azurerm_application_insights.example: Creating...
azurerm_application_insights.example: Still creating... [10s elapsed]
azurerm_application_insights.example: Creation complete after 13s [id=/subscriptions/4e094144-afbc-420a-8d74-a4a0da618a3b/resourceGroups/vlad-example2/providers/microsoft.insights/components/tf-test-appinsights2]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

connection_string = <sensitive>
$ ./terraform output
connection_string = <sensitive>
$ ./terraform version
Terraform v0.12.24
+ provider.azurerm v2.49.0

Your version of Terraform is out of date! The latest version
is 0.14.7. You can update by downloading from https://www.terraform.io/downloads.html
```